HexaCubist/paper-message/firmware/esp32_2-9in/src/esp32_2-9in.ino
// #if defined (ESP8266)
// #include <ESP8266WiFi.h>
// #endif

#include <WiFiClient.h>
#include <WiFiClientSecure.h>

// const char* ssid     = "........";
// const char* password = "........";
#include <WiFiManager.h> // https://github.com/tzapu/WiFiManager
const int httpPort  = 80;
const int httpsPort = 443;

// note: the certificates have been moved to a separate header file, as R"CERT( destroys IDE Auto Format capability

#include "GxEPD2_rsb_raw_certs.h"

const char* certificate_rawcontent = rsb_root;  // ok, should work until Fri, 14 Mar 2025 23:59:59 GMT

const char* rsb_host   = "rsb.nz";
const char* path   = "/api/";
const char* pagesEndpoint = "/pages/";
const char* fp_rawcontent     = "EF:A9:7B:6E:EB:B2:31:B9:9B:2E:13:16:D8:A6:D8:42:4F:83:57:7E"; // SHA-1 as of 24 Aug 2024

// Store token in EEPROM
#include <EEPROM.h>
WiFiManagerParameter *custom_token;
char api_token[64] = "YOUR_API_TOKEN";
bool shouldSaveConfig = false;
void configModeCallback (WiFiManager *myWiFiManager) {
Serial.println("config mode");
}
void saveConfigCallback () {
Serial.println("Should save config now");
shouldSaveConfig = true;
}



// note that BMP bitmaps are drawn at physical position in physical orientation of the screen
void showBitmapFrom_HTTP(const char* host, const char* path, const char* filename, int16_t x, int16_t y, bool with_color = true);
void showBitmapFrom_HTTPS(const char* host, const char* path, const char* filename, const char* fingerprint, int16_t x, int16_t y, bool with_color = true,
                          const char* certificate = certificate_rawcontent);

// draws BMP bitmap according to set orientation
void showBitmapFrom_HTTP_Buffered(const char* host, const char* path, const char* filename, int16_t x, int16_t y, bool with_color = true);
void showBitmapFrom_HTTPS_Buffered(const char* host, const char* path, const char* filename, const char* fingerprint, int16_t x, int16_t y, bool with_color = true,
                                   const char* certificate = certificate_rawcontent);

#if defined(ESP32)
// uncomment next line to use HSPI for EPD (and VSPI for SD), e.g. with Waveshare ESP32 Driver Board
//#define USE_HSPI_FOR_EPD
#endif

#if defined(ARDUINO_RASPBERRY_PI_PICO_W)
// SPIClassRP2040(spi_inst_t *spi, pin_size_t rx, pin_size_t cs, pin_size_t sck, pin_size_t tx);
// uncomment next line for use with Waveshare Pico-ePaper-2.9.
SPIClassRP2040 SPIn(spi1, 12, 13, 10, 11); // need be valid pins for same SPI channel, else fails blinking 4 long 4 short
#endif

#if defined(ESP32) && defined(USE_HSPI_FOR_EPD)
SPIClass hspi(HSPI);
#endif

void setup()
{
#if defined(ESP32) && defined(USE_HSPI_FOR_EPD)
  hspi.begin(13, 12, 14, 15); // remap hspi for EPD (swap pins)
  display.epd2.selectSPI(hspi, SPISettings(4000000, MSBFIRST, SPI_MODE0));
#endif
#if defined(ARDUINO_RASPBERRY_PI_PICO_W)
  delay(2000); // USB serial available
  display.epd2.selectSPI(SPIn, SPISettings(4000000, MSBFIRST, SPI_MODE0));
#endif

    // WiFi.mode(WIFI_STA); // explicitly set mode, esp defaults to STA+AP
    // it is a good practice to make sure your code sets wifi mode how you want it.

    // put your setup code here, to run once:
    Serial.begin(115200);

    // Start the EEPROM
    EEPROM.begin(512);
    Serial.println(EEPROM.readString(0));
    
    //WiFiManager, Local intialization. Once its business is done, there is no need to keep it around
    WiFiManager wm;

    // reset settings - wipe stored credentials for testing
    // these are stored by the esp library
    // wm.resetSettings();


  //display.init(115200); // default 10ms reset pulse, e.g. for bare panels with DESPI-C02
  display.init(115200, true, 2, false); // USE THIS for Waveshare boards with "clever" reset circuit, 2ms reset pulse


  // Automatically connect using saved credentials,
  // if connection fails, it starts an access point with the specified name ( "AutoConnectAP"),
  // if empty will auto generate SSID, if password is blank it will be anonymous AP (wm.autoConnect())
  // then goes into a blocking loop awaiting configuration and will return success result

  bool res;
  // res = wm.autoConnect(); // auto generated AP name from chipid
  wm.setSaveConfigCallback(saveConfigCallback);
  // WiFiManagerParameter custom_token("API Token", "Enter token here", api_token, 60);
  custom_token = new WiFiManagerParameter("api_token", "RSB API Token (visit rsb.nz to get!)", api_token, 64);
  
  wm.addParameter(custom_token);
  wm.setAPCallback(configModeCallback);
  // res = wm.autoConnect("RSB-Device","RSB-Paper"); // password protected ap
  res = wm.autoConnect("RSB-Device"); // anonymous ap

  if(!res) {
      Serial.println("Failed to connect");
  } 
  else {
      Serial.println("connected...yay :)");
      // strcpy(api_token, customParam.getValue());
      strcpy(api_token, custom_token->getValue());
      if (shouldSaveConfig) {
      EEPROM.writeString(0, api_token);delay(100);
      Serial.println(EEPROM.readString(0));
      }
  }

  const int page_num = 0;
  
  setClock();

  char pageNum [10];
  itoa(page_num,pageNum,10);

  // path + user_token + pagesEndpoint
  char full_path [64];
  strcpy(full_path,path);
  strcat(full_path,api_token);
  strcat(full_path,pagesEndpoint);

  showBitmapFrom_HTTPS(rsb_host, full_path, pageNum,fp_rawcontent,0,0);

  Serial.println("GxEPD2_WiFi_Example done");
}

void loop(void)
{
}

static const uint16_t input_buffer_pixels = 800; // may affect performance

static const uint16_t max_row_width = 1872; // for up to 7.8" display 1872x1404
static const uint16_t max_palette_pixels = 256; // for depth <= 8

uint8_t input_buffer[3 * input_buffer_pixels]; // up to depth 24
uint8_t output_row_mono_buffer[max_row_width / 8]; // buffer for at least one row of b/w bits
uint8_t output_row_color_buffer[max_row_width / 8]; // buffer for at least one row of color bits
uint8_t mono_palette_buffer[max_palette_pixels / 8]; // palette buffer for depth <= 8 b/w
uint8_t color_palette_buffer[max_palette_pixels / 8]; // palette buffer for depth <= 8 c/w
uint16_t rgb_palette_buffer[max_palette_pixels]; // palette buffer for depth <= 8 for buffered graphics, needed for 7-color display

